app/controllers/blog_posts/cover_images_controller.rb

    def set_blog_post
        @blog_post = BlogPost.find(params[:blog_post_id])
---
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]