app/controllers/blog_posts_controller.rb

    def create
        @blog_post = BlogPost.new(blog_post_params)
        if @blog_post.save
---
INSERT INTO "blog_posts" ("title", "body", "created_at", "updated_at", "published_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "schedule"], ["body", "future"], ["created_at", "2024-04-30 22:37:18.804303"], ["updated_at", "2024-04-30 22:37:18.804303"], ["published_at", "2027-04-03 02:05:00"]]

    def update
        if @blog_post.update(blog_post_params)
---
UPDATE "blog_posts" SET "updated_at" = $1, "published_at" = $2 WHERE "blog_posts"."id" = $3  [["updated_at", "2024-05-02 04:37:17.618902"], ["published_at", "2019-09-25 19:21:00"], ["id", 5]]

    def destroy
        @blog_post.destroy
---
DELETE FROM "blog_posts" WHERE "blog_posts"."id" = ?  [["id", 2]]